"""
Рисуем квадраты
Написать функцию squares(w,h,(X,Y,s,c),...) со следующими параметрами: w и h — ширина и высота «экрана»,
за которыми следуют 0 или больше 4-элементных последовательностей вида (X,Y,s,c),
где X и Y — координаты левого верхнего угла квадрата, s — длина его стороны (не меньше 1),
а c — символ которым он заполняется на экране. Функция должна выводить прямоугольник из h×w точек,
на котором соответствующими символами «нарисованы» квадраты соответствующих размеров в соответствующих местах.
Координаты левого верхнего угла поля — 0,0. Растут вправо вниз. Проверять, что квадраты не выходят за границы поля,
не надо.

Примеры

Входные данные
squares(20,23,(1,1,5,'@'), (2,3,1,'!'), (4,5,11,'#'), (8,11,9,'/'))

Результат работы
....................
.@@@@@..............
.@@@@@..............
.@!@@@..............
.@@@@@..............
.@@@###########.....
....###########.....
....###########.....
....###########.....
....###########.....
....###########.....
....####/////////...
....####/////////...
....####/////////...
....####/////////...
....####/////////...
......../////////...
......../////////...
......../////////...
......../////////...
....................
....................
....................
"""

def squares(w, h, *args):
    ans = []
    for i in range(h):
        tmp = []
        for j in range(w):
            tmp.append('.')
        ans.append(tmp)
    for x, y, s, c in args:
        for i in range(y, y + s):
            for j in range(x, x + s):
                ans[i][j] = c
    for row in ans:
        print(''.join((row)))


# if __name__ == '__main__':
#     squares(20,23,(1,1,5,'@'), (2,3,1,'!'), (4,5,11,'#'), (8,11,9,'/'))
