"""Написать программу, которая выводит в точности строку "Hello, world"""


if __name__ == '__main__':
    print('Hello, world')
